In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("Adult_Census_Income_Binary_Classification_dataset.csv", index_col=False)

In [3]:
dataset.head()

,age,workclass,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
colnames = []
for i in range(0,len(dataset.columns)):
    colnames.append(dataset.columns[i].lstrip())
dataset.columns = colnames

In [5]:
dataset.dtypes

age                int64
workclass         object
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
income            object
dtype: object

In [6]:
cat_columns = []
for i in [1,2,4,5,6,7,8,12,13]:
    cat_columns.append(dataset.columns[i])
print(cat_columns)

['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'native-country', 'income']

In [7]:
for i in cat_columns:
    dataset[i] = dataset[i].astype('object')
dataset = dataset.replace(" ?", "NA")

In [8]:
for i in cat_columns:
    dataset[i] = dataset[i].astype('category')

In [9]:
dataset.dtypes

age                  int64
workclass         category
education         category
education-num        int64
marital-status    category
occupation        category
relationship      category
race              category
sex               category
capital-gain         int64
capital-loss         int64
hours-per-week       int64
native-country    category
income            category
dtype: object

In [10]:
cats = dataset.workclass.cat.categories

In [11]:
pd.factorize(cats)[0]

array([0, 1, 2, 3, 4, 5, 6, 7, 8], dtype=int64)

In [12]:
for i in cat_columns:
    dataset[i] = pd.Categorical(dataset[i]).codes

In [13]:
dataset.head()

,age,workclass,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,6,9,13,4,0,1,4,1,2174,0,40,38,0
1,50,5,9,13,2,3,0,4,1,0,0,13,38,0
2,38,3,11,9,0,5,1,4,1,0,0,40,38,0
3,53,3,1,7,2,5,0,2,1,0,0,40,38,0
4,28,3,9,13,2,9,5,2,0,0,0,40,4,0

In [14]:
x_vars = []
for i in range(13):
    x_vars.append(dataset.columns[i])
print(x_vars)

['age', 'workclass', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country']

In [15]:
X = []

In [16]:
dataset.tail()

,age,workclass,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
32556,27,3,7,12,2,12,5,4,0,0,0,38,38,0
32557,40,3,11,9,2,6,0,4,1,0,0,40,38,1
32558,58,3,11,9,6,0,4,4,0,0,0,40,38,0
32559,22,3,11,9,4,0,3,4,1,0,0,20,38,0
32560,52,4,11,9,2,3,5,4,0,15024,0,40,38,1

In [17]:
X

[]

In [18]:
from sklearn.neighbors import KNeighborsClassifier

In [19]:
knn = KNeighborsClassifier()

In [20]:
import numpy as np

In [21]:
X = np.array([dataset.age, dataset.workclass, dataset.education, dataset["education-num"], dataset["marital-status"], dataset.occupation, dataset.relationship, dataset.race, dataset.sex, dataset["capital-gain"], dataset["capital-loss"], dataset["hours-per-week"], dataset["native-country"]]).reshape(-1, 13)

In [22]:
knn.fit(X, np.array(dataset.income))

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=5, p=2,
           weights='uniform')

In [23]:
knn.predict(np.array([40,3,11,9,2,6,0,4,1,0,0,40,38]).reshape(-2, 13))[0]

1

In [24]:
knn.predict(np.array([10,3,11,9,2,6,0,4,1,0,0,40,38]).reshape(-2, 13))[0]

0